Ran Plan for 2 projects:

1. project: `prod` dir: `terraform` workspace: `prod`
1. project: `stage` dir: `terraform` workspace: `stage`

### 1. project: `prod` dir: `terraform` workspace: `prod`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # yandex_compute_instance.instance-nat will be created
+ resource "yandex_compute_instance" "instance-nat" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = "nat"
      + id                        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCvy5KgN9ceAvFmFw+vPldqiZM4Ez5SE+lN521YPBt35fMIVtiH1miQPHQ8uJS+dI5v41JiHWGwv90PbAWEULlzvf9E2v7TZvsF9U5MFJwRACiO2Dv4yVkJM/99eHpe/Oi3a51GXbgPsqk078ttoXnlwt8ZjFmb0JR9WFkwjmctRUSSNNgknItRyyTbzllVnPaYXfR2QwIFDg16JbVPrCzRzh8AGKR7uCypHJj6DI0WO4niljsQPaJ84SLOmeM/SWmhCLcu4jiG1ENXs9Y938alr6KQcJ7OHjnbAtbkEkYD7QirMW+Z3cNAxCyKkHecxWUt0dZgZLCzd7tUpujbl1Zjg0Jox6rafMtuqjdwpERDVZ2+0kNz1oVXWLYmFZ4NvQcAVGv9LQziTe0Zke2qKbGE7KSVO525rkeP3Xsm7/zJVBT0TLv86ziIO5KHR5TRDKJCjtMpgsrHKO79QVpuR7OOf1oI0QI4SC4u1n+0vVoGHPGtRsXQKiim7riEzUkona8= a.belyaev@MacBook-Pro-Aleksandr.local
            EOT
        }
      + name                      = "nat"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-a"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8josjq21d56924jfan"
              + name        = (known after apply)
              + size        = 30
              + snapshot_id = (known after apply)
              + type        = "network-ssd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = "192.168.1.254"
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = "51.250.70.183"
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 2
          + memory        = 2
        }

      + scheduling_policy {
          + preemptible = (known after apply)
        }
    }

  # yandex_compute_instance.instance-test will be created
+ resource "yandex_compute_instance" "instance-test" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = "test"
      + id                        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCvy5KgN9ceAvFmFw+vPldqiZM4Ez5SE+lN521YPBt35fMIVtiH1miQPHQ8uJS+dI5v41JiHWGwv90PbAWEULlzvf9E2v7TZvsF9U5MFJwRACiO2Dv4yVkJM/99eHpe/Oi3a51GXbgPsqk078ttoXnlwt8ZjFmb0JR9WFkwjmctRUSSNNgknItRyyTbzllVnPaYXfR2QwIFDg16JbVPrCzRzh8AGKR7uCypHJj6DI0WO4niljsQPaJ84SLOmeM/SWmhCLcu4jiG1ENXs9Y938alr6KQcJ7OHjnbAtbkEkYD7QirMW+Z3cNAxCyKkHecxWUt0dZgZLCzd7tUpujbl1Zjg0Jox6rafMtuqjdwpERDVZ2+0kNz1oVXWLYmFZ4NvQcAVGv9LQziTe0Zke2qKbGE7KSVO525rkeP3Xsm7/zJVBT0TLv86ziIO5KHR5TRDKJCjtMpgsrHKO79QVpuR7OOf1oI0QI4SC4u1n+0vVoGHPGtRsXQKiim7riEzUkona8= a.belyaev@MacBook-Pro-Aleksandr.local
            EOT
        }
      + name                      = "test"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-a"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8j9i69vt27ujq6rqug"
              + name        = (known after apply)
              + size        = 30
              + snapshot_id = (known after apply)
              + type        = "network-ssd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 2
          + memory        = 2
        }

      + scheduling_policy {
          + preemptible = (known after apply)
        }
    }

  # yandex_compute_instance_group.ig-cp will be created
+ resource "yandex_compute_instance_group" "ig-cp" {
      + created_at          = (known after apply)
      + deletion_protection = false
      + folder_id           = "b1g9eq93ionckal26dpc"
      + id                  = (known after apply)
      + instances           = (known after apply)
      + name                = "ig-cp"
      + service_account_id  = (known after apply)
      + status              = (known after apply)

      + allocation_policy {
          + zones = [
              + "ru-central1-a",
              + "ru-central1-b",
              + "ru-central1-c",
            ]
        }

      + deploy_policy {
          + max_creating     = 0
          + max_deleting     = 0
          + max_expansion    = 0
          + max_unavailable  = 1
          + startup_duration = 0
          + strategy         = (known after apply)
        }

      + instance_template {
          + hostname    = "cp{instance.index}"
          + labels      = (known after apply)
          + metadata    = {
              + "ssh-keys" = <<-EOT
                    ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCvy5KgN9ceAvFmFw+vPldqiZM4Ez5SE+lN521YPBt35fMIVtiH1miQPHQ8uJS+dI5v41JiHWGwv90PbAWEULlzvf9E2v7TZvsF9U5MFJwRACiO2Dv4yVkJM/99eHpe/Oi3a51GXbgPsqk078ttoXnlwt8ZjFmb0JR9WFkwjmctRUSSNNgknItRyyTbzllVnPaYXfR2QwIFDg16JbVPrCzRzh8AGKR7uCypHJj6DI0WO4niljsQPaJ84SLOmeM/SWmhCLcu4jiG1ENXs9Y938alr6KQcJ7OHjnbAtbkEkYD7QirMW+Z3cNAxCyKkHecxWUt0dZgZLCzd7tUpujbl1Zjg0Jox6rafMtuqjdwpERDVZ2+0kNz1oVXWLYmFZ4NvQcAVGv9LQziTe0Zke2qKbGE7KSVO525rkeP3Xsm7/zJVBT0TLv86ziIO5KHR5TRDKJCjtMpgsrHKO79QVpuR7OOf1oI0QI4SC4u1n+0vVoGHPGtRsXQKiim7riEzUkona8= a.belyaev@MacBook-Pro-Aleksandr.local
                EOT
            }
          + name        = "cp{instance.index}"
          + platform_id = "standard-v3"

          + boot_disk {
              + device_name = (known after apply)
              + mode        = "READ_WRITE"

              + initialize_params {
                  + image_id    = "fd8kdq6d0p8sij7h5qe3"
                  + size        = 30
                  + snapshot_id = (known after apply)
                  + type        = "network-ssd"
                }
            }

          + network_interface {
              + ip_address   = (known after apply)
              + ipv4         = true
              + ipv6         = (known after apply)
              + ipv6_address = (known after apply)
              + nat          = (known after apply)
              + network_id   = (known after apply)
              + subnet_ids   = (known after apply)
            }

          + resources {
              + core_fraction = 100
              + cores         = 2
              + memory        = 4
            }

          + scheduling_policy {
              + preemptible = (known after apply)
            }
        }

      + load_balancer {
          + status_message    = (known after apply)
          + target_group_id   = (known after apply)
          + target_group_name = "cp-target-group-lb"
        }

      + scale_policy {

          + fixed_scale {
              + size = 3
            }
        }
    }

  # yandex_compute_instance_group.ig-nodes will be created
+ resource "yandex_compute_instance_group" "ig-nodes" {
      + created_at          = (known after apply)
      + deletion_protection = false
      + folder_id           = "b1g9eq93ionckal26dpc"
      + id                  = (known after apply)
      + instances           = (known after apply)
      + name                = "ig-nodes"
      + service_account_id  = (known after apply)
      + status              = (known after apply)

      + allocation_policy {
          + zones = [
              + "ru-central1-a",
              + "ru-central1-b",
              + "ru-central1-c",
            ]
        }

      + deploy_policy {
          + max_creating     = 0
          + max_deleting     = 0
          + max_expansion    = 0
          + max_unavailable  = 1
          + startup_duration = 0
          + strategy         = (known after apply)
        }

      + instance_template {
          + hostname    = "node{instance.index}"
          + labels      = (known after apply)
          + metadata    = {
              + "ssh-keys" = <<-EOT
                    ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCvy5KgN9ceAvFmFw+vPldqiZM4Ez5SE+lN521YPBt35fMIVtiH1miQPHQ8uJS+dI5v41JiHWGwv90PbAWEULlzvf9E2v7TZvsF9U5MFJwRACiO2Dv4yVkJM/99eHpe/Oi3a51GXbgPsqk078ttoXnlwt8ZjFmb0JR9WFkwjmctRUSSNNgknItRyyTbzllVnPaYXfR2QwIFDg16JbVPrCzRzh8AGKR7uCypHJj6DI0WO4niljsQPaJ84SLOmeM/SWmhCLcu4jiG1ENXs9Y938alr6KQcJ7OHjnbAtbkEkYD7QirMW+Z3cNAxCyKkHecxWUt0dZgZLCzd7tUpujbl1Zjg0Jox6rafMtuqjdwpERDVZ2+0kNz1oVXWLYmFZ4NvQcAVGv9LQziTe0Zke2qKbGE7KSVO525rkeP3Xsm7/zJVBT0TLv86ziIO5KHR5TRDKJCjtMpgsrHKO79QVpuR7OOf1oI0QI4SC4u1n+0vVoGHPGtRsXQKiim7riEzUkona8= a.belyaev@MacBook-Pro-Aleksandr.local
                EOT
            }
          + name        = "node{instance.index}"
          + platform_id = "standard-v3"

          + boot_disk {
              + device_name = (known after apply)
              + mode        = "READ_WRITE"

              + initialize_params {
                  + image_id    = "fd8kdq6d0p8sij7h5qe3"
                  + size        = 30
                  + snapshot_id = (known after apply)
                  + type        = "network-ssd"
                }
            }

          + network_interface {
              + ip_address   = (known after apply)
              + ipv4         = true
              + ipv6         = (known after apply)
              + ipv6_address = (known after apply)
              + nat          = (known after apply)
              + network_id   = (known after apply)
              + subnet_ids   = (known after apply)
            }

          + resources {
              + core_fraction = 100
              + cores         = 2
              + memory        = 4
            }

          + scheduling_policy {
              + preemptible = (known after apply)
            }
        }

      + load_balancer {
          + status_message    = (known after apply)
          + target_group_id   = (known after apply)
          + target_group_name = "nodes-target-group-lb"
        }

      + scale_policy {

          + fixed_scale {
              + size = 3
            }
        }
    }

  # yandex_iam_service_account.ig-sa will be created
+ resource "yandex_iam_service_account" "ig-sa" {
      + created_at  = (known after apply)
      + description = "service account to manage IG"
      + folder_id   = (known after apply)
      + id          = (known after apply)
      + name        = "ig-sa"
    }

  # yandex_lb_network_load_balancer.cp-lb will be created
+ resource "yandex_lb_network_load_balancer" "cp-lb" {
      + created_at = (known after apply)
      + folder_id  = (known after apply)
      + id         = (known after apply)
      + name       = "cp-load-balancer"
      + type       = "external"

      + attached_target_group {
          + target_group_id = (known after apply)

          + healthcheck {
              + healthy_threshold   = 3
              + interval            = 5
              + name                = "tcp"
              + timeout             = 2
              + unhealthy_threshold = 3

              + tcp_options {
                  + port = 6443
                }
            }
        }

      + listener {
          + name        = "my-masters"
          + port        = 6443
          + protocol    = (known after apply)
          + target_port = (known after apply)

          + external_address_spec {
              + address    = "84.201.141.69"
              + ip_version = "ipv4"
            }
        }
    }

  # yandex_lb_network_load_balancer.nodes-lb will be created
+ resource "yandex_lb_network_load_balancer" "nodes-lb" {
      + created_at = (known after apply)
      + folder_id  = (known after apply)
      + id         = (known after apply)
      + name       = "nodes-load-balancer"
      + type       = "external"

      + attached_target_group {
          + target_group_id = (known after apply)

          + healthcheck {
              + healthy_threshold   = 3
              + interval            = 5
              + name                = "http"
              + timeout             = 2
              + unhealthy_threshold = 3

              + http_options {
                  + path = "/healthz"
                  + port = 8081
                }
            }
        }

      + listener {
          + name        = "atlantis"
          + port        = 4141
          + protocol    = (known after apply)
          + target_port = 30001

          + external_address_spec {
              + address    = (known after apply)
              + ip_version = "ipv4"
            }
        }
      + listener {
          + name        = "grafana"
          + port        = 3000
          + protocol    = (known after apply)
          + target_port = 30902

          + external_address_spec {
              + address    = (known after apply)
              + ip_version = "ipv4"
            }
        }
      + listener {
          + name        = "my-app"
          + port        = 80
          + protocol    = (known after apply)
          + target_port = 30000

          + external_address_spec {
              + address    = (known after apply)
              + ip_version = "ipv4"
            }
        }
    }

  # yandex_resourcemanager_folder_iam_binding.editor will be created
+ resource "yandex_resourcemanager_folder_iam_binding" "editor" {
      + folder_id = "b1g9eq93ionckal26dpc"
      + id        = (known after apply)
      + members   = (known after apply)
      + role      = "editor"
    }

  # yandex_resourcemanager_folder_iam_binding.images-puller will be created
+ resource "yandex_resourcemanager_folder_iam_binding" "images-puller" {
      + folder_id = "b1g9eq93ionckal26dpc"
      + id        = (known after apply)
      + members   = (known after apply)
      + role      = "container-registry.images.puller"
    }

  # yandex_vpc_network.lab-net will be created
+ resource "yandex_vpc_network" "lab-net" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + folder_id                 = (known after apply)
      + id                        = (known after apply)
      + labels                    = (known after apply)
      + name                      = "lab-network"
      + subnet_ids                = (known after apply)
    }

  # yandex_vpc_route_table.lab-rt-a will be created
+ resource "yandex_vpc_route_table" "lab-rt-a" {
      + created_at = (known after apply)
      + folder_id  = (known after apply)
      + id         = (known after apply)
      + labels     = (known after apply)
      + name       = "lab-rt-a"
      + network_id = (known after apply)

      + static_route {
          + destination_prefix = "0.0.0.0/0"
          + next_hop_address   = "192.168.1.254"
        }
    }

  # yandex_vpc_subnet.private-a will be created
+ resource "yandex_vpc_subnet" "private-a" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "private-a"
      + network_id     = (known after apply)
      + route_table_id = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.20.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

  # yandex_vpc_subnet.private-b will be created
+ resource "yandex_vpc_subnet" "private-b" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "private-b"
      + network_id     = (known after apply)
      + route_table_id = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.21.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-b"
    }

  # yandex_vpc_subnet.private-c will be created
+ resource "yandex_vpc_subnet" "private-c" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "private-c"
      + network_id     = (known after apply)
      + route_table_id = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.22.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-c"
    }

  # yandex_vpc_subnet.public will be created
+ resource "yandex_vpc_subnet" "public" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "public"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.1.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ bastion_external_ip  = [
      + "51.250.70.183",
    ]
+ cp_ips               = [
      + (known after apply),
    ]
+ cp_names             = [
      + (known after apply),
    ]
+ lb_cp_external_ip    = [
      + [
          + [
              + "84.201.141.69",
            ],
        ],
    ]
+ lb_nodes_external_ip = [
      + [
          + [
              + (known after apply),
            ],
          + [
              + (known after apply),
            ],
          + [
              + (known after apply),
            ],
        ],
    ]
+ node_names           = [
      + (known after apply),
    ]
+ nodes_ips            = [
      + (known after apply),
    ]

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p prod`
* :put_litter_in_its_place: To **delete** this plan click [here](http://51.250.69.170:4141/lock?id=belas80%252Fdevops-diplom-netology%252Fterraform%252Fprod)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p prod`
</details>
Plan: 15 to add, 0 to change, 0 to destroy.

---
### 2. project: `stage` dir: `terraform` workspace: `stage`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # yandex_compute_instance.instance-test will be created
+ resource "yandex_compute_instance" "instance-test" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = "test"
      + id                        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCvy5KgN9ceAvFmFw+vPldqiZM4Ez5SE+lN521YPBt35fMIVtiH1miQPHQ8uJS+dI5v41JiHWGwv90PbAWEULlzvf9E2v7TZvsF9U5MFJwRACiO2Dv4yVkJM/99eHpe/Oi3a51GXbgPsqk078ttoXnlwt8ZjFmb0JR9WFkwjmctRUSSNNgknItRyyTbzllVnPaYXfR2QwIFDg16JbVPrCzRzh8AGKR7uCypHJj6DI0WO4niljsQPaJ84SLOmeM/SWmhCLcu4jiG1ENXs9Y938alr6KQcJ7OHjnbAtbkEkYD7QirMW+Z3cNAxCyKkHecxWUt0dZgZLCzd7tUpujbl1Zjg0Jox6rafMtuqjdwpERDVZ2+0kNz1oVXWLYmFZ4NvQcAVGv9LQziTe0Zke2qKbGE7KSVO525rkeP3Xsm7/zJVBT0TLv86ziIO5KHR5TRDKJCjtMpgsrHKO79QVpuR7OOf1oI0QI4SC4u1n+0vVoGHPGtRsXQKiim7riEzUkona8= a.belyaev@MacBook-Pro-Aleksandr.local
            EOT
        }
      + name                      = "test"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-a"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8j9i69vt27ujq6rqug"
              + name        = (known after apply)
              + size        = 30
              + snapshot_id = (known after apply)
              + type        = "network-ssd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = "e9bfgl3p9a1qfigaetsl"
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 2
          + memory        = 2
        }

      + scheduling_policy {
          + preemptible = (known after apply)
        }
    }

  # yandex_lb_network_load_balancer.cp-lb will be updated in-place
~ resource "yandex_lb_network_load_balancer" "cp-lb" {
        id         = "enp1q33plbuiv1lvqf60"
        name       = "cp-load-balancer"
      - region_id  = "ru-central1" -> null
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # yandex_lb_network_load_balancer.nodes-lb will be updated in-place
~ resource "yandex_lb_network_load_balancer" "nodes-lb" {
        id         = "enp8kmt76qehkehvm4jk"
        name       = "nodes-load-balancer"
      - region_id  = "ru-central1" -> null
        # (4 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p stage`
* :put_litter_in_its_place: To **delete** this plan click [here](http://51.250.69.170:4141/lock?id=belas80%252Fdevops-diplom-netology%252Fterraform%252Fstage)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p stage`
</details>
Plan: 1 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
